In [11]:
import numpy as np
import pandas as pd

In [12]:
# create a test dataframe

df = pd.DataFrame({
    "Name": ['Alice', 'Bob', 'Bill', 'Frank'],
    "Score": [100, 70, 90, 40],
    "Level": ['A', 'C', 'B', 'D']
})

In [13]:
df

    Name  Score Level
0  Alice    100     A
1    Bob     70     C
2   Bill     90     B
3  Frank     40     D

In [14]:
df['Grade'] = df['Score'].apply(
    lambda x: x/10)

In [15]:
df

    Name  Score Level  Grade
0  Alice    100     A   10.0
1    Bob     70     C    7.0
2   Bill     90     B    9.0
3  Frank     40     D    4.0

In [20]:
df['Exam Result'] = df['Grade'].apply(
    lambda x: 'Passed' if x >= 5.0 else 'Failed'
)

In [21]:
df

    Name  Score Level  Grade Exam Result
0  Alice    100     A   10.0      Passed
1    Bob     70     C    7.0      Passed
2   Bill     90     B    9.0      Passed
3  Frank     40     D    4.0      Failed